[1]	A. Sánchez-Macián et al. 2017. SEFI Protection for Nanosat 16-Bit Chip Onboard Computer Memories. IEEE Transactions on Device and Materials Reliability. 17, 4(2017), 698-707. DOI:https://doi.org/10.1109/TDMR.2017.2750718.
 
[2]	C. Ogden et al. 2017. The Impact of Soft Error Event Topography on the Reliability of Computer Memories. IEEE Transactions on Reliability. 66, 4(2017), 966-979. DOI:https://doi.org/10.1109/TR.2017.2765484.
 
[3]	D. P. Oleary. 2006. Computer memory and arithmetic: a look under the hood. Computing in Science Engineering. 8, 3(2006), 54-59. DOI:https://doi.org/10.1109/MCSE.2006.39.
 
[4]	E. Medina. 2005. Computer Memory, Collective Memory: Recovering History through Chilean Computing. IEEE Annals of the History of Computing. 27, 4(2005), 104-103. DOI:https://doi.org/10.1109/MAHC.2005.56.
 
[5]	S. Fan et al. 2018. Parallel Electromagnetic Transients Simulation with Shared Memory Architecture Computers. IEEE Transactions on Power Delivery. 33, 1(2018), 239-247. DOI:https://doi.org/10.1109/TPWRD.2017.2714639.
 
[6]	R. Chen et al. 2017. Computer Generation of High Throughput and Memory Efficient Sorting Designs on FPGA. IEEE Transactions on Parallel and Distributed Systems. 28, 11(2017), 3100-3113. DOI:https://doi.org/10.1109/TPDS.2017.2705128.
 
[7]	I. Nassi. 2017. Scaling the Computer to the Problem: Application Programming with Unlimited Memory. Computer. 50, 8(2017), 46-51. DOI:https://doi.org/10.1109/MC.2017.3001249.
 
[8]	T. Maqsood et al. 2017. Leveraging on Deep Memory Hierarchies to Minimize Energy Consumption and Data Access Latency on Single-Chip Cloud Computers. IEEE Transactions on Sustainable Computing. 2, 2(2017), 154-166. DOI:https://doi.org/10.1109/TSUSC.2017.2706620.
 
[9]	L. Grigoryeva et al. 2016. Nonlinear Memory Capacity of Parallel Time-Delay Reservoir Computers in the Processing of Multidimensional Signals. Neural Computation. 28, 7(2016), 1411-1451. DOI:https://doi.org/10.1162/NECO_a_00845.
 
[10]	S. Bardhan et al. 2015. Predicting the Effect of Memory Contention in Multi-Core Computers Using Analytic Performance Models. IEEE Transactions on Computers. 64, 8(2015), 2279-2292. DOI:https://doi.org/10.1109/TC.2014.2361511.
 
[11]	C. Healey et al. 2012. Attention and Visual Memory in Visualization and Computer Graphics. IEEE Transactions on Visualization and Computer Graphics. 18, 7(2012), 1170-1188. DOI:https://doi.org/10.1109/TVCG.2011.127.
 
