A. Sánchez-Macián, P. Reviriego, J. Tabero, A. Regadío, J. A. Maestro. "SEFI Protection for Nanosat 16-Bit Chip Onboard Computer Memories", IEEE Transactions on Device and Materials Reliability, vol. 17, no. 4, p. 698-707, Dec 2017.
C. Ogden, M. Mascagni. "The Impact of Soft Error Event Topography on the Reliability of Computer Memories", IEEE Transactions on Reliability, vol. 66, no. 4, p. 966-979, Dec 2017.
D. P. Oleary. "Computer memory and arithmetic: a look under the hood", Computing in Science Engineering, vol. 8, no. 3, p. 54-59, May 2006.
E. Medina. "Computer Memory, Collective Memory: Recovering History through Chilean Computing", IEEE Annals of the History of Computing, vol. 27, no. 4, p. 104-103, Oct 2005.
S. Fan, H. Ding, A. Kariyawasam, A. M. Gole. "Parallel Electromagnetic Transients Simulation with Shared Memory Architecture Computers", IEEE Transactions on Power Delivery, vol. 33, no. 1, p. 239-247, Feb 2018.
R. Chen, V. K. Prasanna. "Computer Generation of High Throughput and Memory Efficient Sorting Designs on FPGA", IEEE Transactions on Parallel and Distributed Systems, vol. 28, no. 11, p. 3100-3113, Nov 2017.
I. Nassi. "Scaling the Computer to the Problem: Application Programming with Unlimited Memory", Computer, vol. 50, no. 8, p. 46-51, Oct 2017.
T. Maqsood, N. Tziritas, T. Loukopoulos, S. A. Madani, S. U. Khan, C. Z. Xu. "Leveraging on Deep Memory Hierarchies to Minimize Energy Consumption and Data Access Latency on Single-Chip Cloud Computers", IEEE Transactions on Sustainable Computing, vol. 2, no. 2, p. 154-166, April 2017.
L. Grigoryeva, J. Henriques, L. Larger, J. P. Ortega. "Nonlinear Memory Capacity of Parallel Time-Delay Reservoir Computers in the Processing of Multidimensional Signals", Neural Computation, vol. 28, no. 7, p. 1411-1451, July 2016.
S. Bardhan, D. A. Menascé. "Predicting the Effect of Memory Contention in Multi-Core Computers Using Analytic Performance Models", IEEE Transactions on Computers, vol. 64, no. 8, p. 2279-2292, Aug 2015.
C. Healey, J. Enns. "Attention and Visual Memory in Visualization and Computer Graphics", IEEE Transactions on Visualization and Computer Graphics, vol. 18, no. 7, p. 1170-1188, July 2012.
